app/views/guest_lists/index.html.erb

SELECT "guests".* FROM "guests" INNER JOIN "events_guests" ON "guests"."id" = "events_guests"."guest_id" WHERE "events_guests"."event_id" = ?  [["event_id", 1]]
---
          <td>
            <%= guest.guest_lists.find_by(event_id: @event.id).rsvp_status %>  <!-- Display RSVP status for this event -->